Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum
All subclasses of analysis objects are defined here. This enumeration can be used to
select certain types of analysis objects.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_NOT_DEFINED
The analysis object type is not defined.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_MODEL
This type is for selecting analysis models from the current Tekla Structures model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_PART
This type is for selecting analysis parts from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_BAR
This type is for selecting analysis bars from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_AREA
This type is for selecting analysis areas from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_VOLUME
This type is for selecting analysis volumes from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_MEMBER
This type is for selecting analysis members from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_DECOMPOSED_LOAD_NODE
This type is for selecting decomposed node loads from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_DECOMPOSED_LOAD_BAR
This type is for selecting decomposed bar loads from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_DECOMPOSED_LOAD_AREA
This type is for selecting decomposed area loads from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_DECOMPOSED_LOAD_MEMBER
This type is for selecting decomposed member loads from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_DECOMPOSED_LOAD_SELFWEIGHT
This type is for selecting decomposed selfweight loads from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_DECOMPOSED_LOAD_TEMPERATURE
This type is for selecting decomposed temperature loads from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_AREA_POLYGON
This type is for selecting area polygons from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_AREA_HOLE
This type is for selecting area holes from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_EDGE
This type is for selecting area edges from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_EDGE_HOLE
This type is for selecting area hole edges from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_POSITION_BAR
This type is for selecting bar positions from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_POSITION_AREA
This type is for selecting area polygon positions from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_POSITION_AREA_INNER
This type is for selecting area inner positions from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_POSITION_AREA_HOLE
This type is for selecting area hole positions from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_POSITION_EDGE_SPLIT
This type is for selecting edge split positions from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_POSITION_EDGE_SPLIT_HOLE
This type is for selecting edge split hole positions from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_POSITION_FACE
This type is for selecting face positions from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_NODE
This type is for selecting analysis nodes from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_NODE_LINK
This type is for selecting analysis node links from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_DESIGN_PARAMETER
This type is for selecting analysis design parameters from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_DESIGN_PARAMETER_MULTI
This type is for selecting analysis design multi parameters from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_MODEL_CONNECTIVITY_RULE
This type is for selecting analysis connectivity rules from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_FACE
This type is for selecting analysis faces from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_VOLUME_ITEM
This type is for selecting analysis volume items from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_CROSS_SECTION
This type is for selecting analysis cross sections from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_SUB_SECTION
This type is for selecting analysis subsections from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_MATERIAL
This type is for selecting analysis materials from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_CROSS_SECTION_GROUP
This type is for selecting analysis cross section groups from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_RIGID_DIAPHRAGM
This type is for selecting analysis rigid diaphragms from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_LOAD_GROUP
This type is for selecting analysis load groups from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_LOAD_COMBINATION
This type is for selecting analysis load combinations from the current analysis model.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum.ANALYSIS_MODEL_LOAD
This type is for selecting model loads from the current analysis model.